Если вы только начали знакомство с иностранным языком, читайте тексты, которые
 вы уже ранее читали на русском языке. Обратите внимание на небольшие рассказы 
или сказки. Также можно слушать адаптированные книги на английском языке: в этом
 случае вы сможете тренировать слуховой аппарат и оттачивать восприятие текста н
а слух. Где можно найти тексты для начинающих? Загляните на сайт Британского Совета,
 где вы сможете читать один и тот же текст, 
написанный для различных уровней владения языком. Узнать свой уровень вы можете здесь.